# Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество
# элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

# def list_arithmetic_progression(list, size, d, x):
#     for i in range(2, size + 1):
#         list.append(x + (i - 1) * d)
#     return list
# size = int(input("Введите размер вашего массива: "))
# x = int(input("Введите первый элемент вашего массива: "))
# d = int(input("Введите разность в арифметической прогрессии: "))
# list = [x]
# print(list_arithmetic_progression(list, size, d, x))

